blog/app/views/posts/report.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [[nil, 6]]
---
        <td><%= post.updated_at.to_date %></td>
        <td align="center"><%= post.comments.size %></td>