blog/app/views/posts/show.html.erb

  <col width="15%">
  <% @post.comments.order(created_at: :desc).each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."Post_id" = ?  ORDER BY "comments"."created_at" DESC  [["Post_id", 0]]