blog/app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
      if @comment.save
---
INSERT INTO "comments" ("content", "Post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Hola\r\n"], ["Post_id", 6], ["created_at", "2015-04-08 06:41:59.517117"], ["updated_at", "2015-04-08 06:41:59.517117"]]