blog/app/controllers/posts_controller.rb

  def index
    if params[:search]==nil
         @posts = Post.all.order(created_at: :desc)
---
SELECT "posts".* FROM "posts" WHERE ((description LIKE '%%' OR title LIKE '%%') AND category ='Inspirational')  ORDER BY "posts"."created_at" DESC

  def report
    @posts = Post.all.order(created_at: :desc)
---
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC

  def index_viewer
    if params[:search]==nil
         @posts = Post.all.order(created_at: :desc)
---
SELECT "posts".* FROM "posts" WHERE (description LIKE '%%' OR title LIKE '%%' AND category =='%Inspirational%')  ORDER BY "posts"."created_at" DESC

  def like
        @post = Post.find(params[:id])
        @post.likes+=1
    if @post.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "posts" SET "likes" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["likes", 1], ["updated_at", "2015-04-08 04:50:40.407004"], ["id", 2]]

  def like2
        @post = Post.find(params[:id])
        @post.likes+=1
    if @post.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", nil]]
UPDATE "posts" SET "likes" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["likes", 9], ["updated_at", "2015-04-08 05:13:09.885272"], ["id", 2]]

  def create
    @post = Post.new(post_params)
    @post.likes=0
    @post.user_id=1
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "description", "category", "likes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "-"], ["description", "-"], ["category", "Inspirational"], ["likes", 0], ["created_at", "2015-04-08 17:39:15.159237"], ["updated_at", "2015-04-08 17:39:15.159237"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "dfafdaasfa"], ["updated_at", "2015-04-08 03:01:37.678496"], ["id", 2]]